[Killed] BlockStatement
src/components/Auth/AuthProvider.tsx:22:7
 );
 export const AuthProvider: React.FC<PropsWithChildren<unknown>> = ({
   children,
-}) => {
-  const dispatch = useAppDispatch();
-  const user = useAppSelector(userNameSelector);
-
-  const auth = useCallback((name: string) => dispatch(login(name)), [dispatch]);
-  const logout = useCallback(() => dispatch({ type: LOGOUT_SAGA }), [dispatch]);
-
-  return (
-    <AuthProviderContext.Provider value={{ user, logout, login: auth }}>
-      {children}
-    </AuthProviderContext.Provider>
-  );
-};
+}) => {};
 
 export default memo(AuthProvider);
killedBy: AuthProvider initial render and no userName in local storage, then userName is null
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
     
  </div>
</body>

[Killed] ArrowFunction
src/components/Auth/AuthProvider.tsx:26:28
   const dispatch = useAppDispatch();
   const user = useAppSelector(userNameSelector);
 
-  const auth = useCallback((name: string) => dispatch(login(name)), [dispatch]);
+  const auth = useCallback(() => undefined, [dispatch]);
   const logout = useCallback(() => dispatch({ type: LOGOUT_SAGA }), [dispatch]);
 
killedBy: AuthProvider login, then user name is correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Vasya"
Received: ""

[Survived] ArrowFunction
src/components/Auth/AuthProvider.tsx:27:30
   const user = useAppSelector(userNameSelector);
 
   const auth = useCallback((name: string) => dispatch(login(name)), [dispatch]);
-  const logout = useCallback(() => dispatch({ type: LOGOUT_SAGA }), [dispatch]);
+  const logout = useCallback(() => undefined, [dispatch]);
 
   return (
