[NoCoverage] BlockStatement
Education/ReactLearnOtus/src/App.tsx:5:28
 import "./style/main.scss";
 import Navigation from "./components/Navigation";
 
-export const App = ({}) => {
-  return <Navigation />;
-};
+export const App = ({}) => {};
 
