[NoCoverage] BlockStatement
src/components/HeaderWrap/index.tsx:12:7
 
 export const HeaderWrap: React.FC<PropsWithChildren<unknown>> = ({
   children,
-}) => {
-  const { searchColor } = useAppSelector(gameInfoSelector);
-  const statistic = useAppSelector(statisticSelector);
-  return (
-    <div className={s.wrap}>
-      <Header color={searchColor} statistic={statistic} />
-      <main>{children}</main>
-    </div>
-  );
-};
+}) => {};
 
 export default HeaderWrap;
