[NoCoverage] BlockStatement
ReactLearnOtus/src/pages/AuthPage.tsx:4:43
 import React from "react";
 import { Auth } from "../components/Auth";
 
-export const AuthPage: React.FC = ({}) => {
-  return <Auth />;
-};
+export const AuthPage: React.FC = ({}) => {};
 
 export default AuthPage;
