[Killed] BlockStatement
src/components/Auth/AuthContainer.tsx:8:48
 import { NavigationState } from "../../types";
 import { AuthProviderContext } from "./AuthProvider";
 
-export const AuthContainer: React.FC = ({}) => {
-  const { login } = useContext(AuthProviderContext);
-  const location = useLocation();
-  const navigate = useNavigate();
-
-  const { value, onChange } = useInput("");
-
-  const onSubmit = useCallback(() => {
-    const state = location.state as NavigationState;
-    login(value);
-    navigate(state?.from || "/");
-  }, [location.state, login, navigate, value]);
-
-  return <Auth value={value} onChange={onChange} onSubmit={onSubmit} />;
-};
+export const AuthContainer: React.FC = ({}) => {};
 
 export default memo(AuthContainer);
killedBy: AuthContainer Auth entry logic
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="auth-input"]

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Auth/AuthContainer.tsx:15:38
 
   const { value, onChange } = useInput("");
 
-  const onSubmit = useCallback(() => {
-    const state = location.state as NavigationState;
-    login(value);
-    navigate(state?.from || "/");
-  }, [location.state, login, navigate, value]);
+  const onSubmit = useCallback(() => {}, [location.state, login, navigate, value]);
 
   return <Auth value={value} onChange={onChange} onSubmit={onSubmit} />;
killedBy: AuthContainer Auth entry logic
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Евгений"

Number of calls: 0

[Killed] OptionalChaining
src/components/Auth/AuthContainer.tsx:18:14
   const onSubmit = useCallback(() => {
     const state = location.state as NavigationState;
     login(value);
-    navigate(state?.from || "/");
+    navigate(state.from || "/");
   }, [location.state, login, navigate, value]);
 
killedBy: AuthContainer Auth entry logic
statusReason: TypeError: Cannot read properties of null (reading 'from')

[Killed] LogicalOperator
src/components/Auth/AuthContainer.tsx:18:14
   const onSubmit = useCallback(() => {
     const state = location.state as NavigationState;
     login(value);
-    navigate(state?.from || "/");
+    navigate(state?.from && "/");
   }, [location.state, login, navigate, value]);
 
killedBy: AuthContainer Auth entry logic
statusReason: TypeError: Cannot read properties of undefined (reading 'pathname')

[Killed] ArrayDeclaration
src/components/Auth/AuthContainer.tsx:19:6
     const state = location.state as NavigationState;
     login(value);
     navigate(state?.from || "/");
-  }, [location.state, login, navigate, value]);
+  }, []);
 
   return <Auth value={value} onChange={onChange} onSubmit={onSubmit} />;
killedBy: AuthContainer Auth entry logic
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Евгений"
Received: ""

Number of calls: 1
