[NoCoverage] BooleanLiteral
components/Main/Cards/Cards.tsx:27:13
   message,
   nextLevel,
   status,
-  openAll = false,
+  openAll = true,
   size,
   onChooseCard,

[Killed] ConditionalExpression
components/Main/Cards/Cards.tsx:40:36
       }}
     >
       <div
-        className={clsx(s.endGame, status === "end" ? s.active : "")}
+        className={clsx(s.endGame, true ? s.active : "")}
         data-testid="end-game-wrap"
       >
killedBy: Cards End Game View should NOT visible End Game view if status 'start'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
components/Main/Cards/Cards.tsx:40:36
       }}
     >
       <div
-        className={clsx(s.endGame, status === "end" ? s.active : "")}
+        className={clsx(s.endGame, false ? s.active : "")}
         data-testid="end-game-wrap"
       >
killedBy: Cards End Game View should visible End Game view
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] EqualityOperator
components/Main/Cards/Cards.tsx:47:10
         <Button onClick={replay} data-testid="end-game-btn">
           Сыграть снова
         </Button>
-        {message.toLowerCase().indexOf("выиграли") > -1 && (
+        {message.toLowerCase().indexOf("выиграли") <= -1 && (
           <Button onClick={nextLevel}>Следующий уровень</Button>
         )}

[Survived] LogicalOperator
components/Main/Cards/Cards.tsx:47:10
         <Button onClick={replay} data-testid="end-game-btn">
           Сыграть снова
         </Button>
-        {message.toLowerCase().indexOf("выиграли") > -1 && (
-          <Button onClick={nextLevel}>Следующий уровень</Button>
-        )}
+        {message.toLowerCase().indexOf("выиграли") > -1 || <Button onClick={nextLevel}>Следующий уровень</Button>}
       </div>
       {filledArray.map((row) => {

[Killed] BlockStatement
components/Main/Cards/Cards.tsx:51:33
           <Button onClick={nextLevel}>Следующий уровень</Button>
         )}
       </div>
-      {filledArray.map((row) => {
-        return row.map((col) => (
-          <Card
-            key={col.id}
-            style={{
-              width: size,
-              height: size,
-            }}
-            color={col.color}
-            active={openAll || active.includes(col.id)}
-            onClick={() => onChooseCard(col.id)}
-          />
-        ));
-      })}
+      {filledArray.map((row) => {})}
     </div>
   );
killedBy: Cards markup Cards
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="card"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="cards"
      data-testid="cards"

[Killed] ArrowFunction
components/Main/Cards/Cards.tsx:52:24
         )}
       </div>
       {filledArray.map((row) => {
-        return row.map((col) => (
-          <Card
-            key={col.id}
-            style={{
-              width: size,
-              height: size,
-            }}
-            color={col.color}
-            active={openAll || active.includes(col.id)}
-            onClick={() => onChooseCard(col.id)}
-          />
-        ));
+        return row.map(() => undefined);
       })}
     </div>
killedBy: Cards markup Cards
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="card"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="cards"
      data-testid="cards"

[Killed] LogicalOperator
components/Main/Cards/Cards.tsx:60:21
               height: size,
             }}
             color={col.color}
-            active={openAll || active.includes(col.id)}
+            active={openAll && active.includes(col.id)}
             onClick={() => onChooseCard(col.id)}
           />
killedBy: Cards Cards Logic should active few cards
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
components/Main/Cards/Cards.tsx:60:21
               height: size,
             }}
             color={col.color}
-            active={openAll || active.includes(col.id)}
+            active={false}
             onClick={() => onChooseCard(col.id)}
           />
killedBy: Cards Cards Logic should active few cards
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
components/Main/Cards/Cards.tsx:61:22
             }}
             color={col.color}
             active={openAll || active.includes(col.id)}
-            onClick={() => onChooseCard(col.id)}
+            onClick={() => undefined}
           />
         ));
killedBy: Cards Cards Logic call Card click func with index param
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "01"

Number of calls: 0
