[Survived] BlockStatement
components/Main/Cards/CardsContainer.tsx:31:19
   const [size, setSize] = useState(40);
   const elementRef = useRef<HTMLDivElement>(null);
 
-  useEffect(() => {
-    setSize(
-      elementRef.current?.clientWidth && level
-        ? elementRef.current?.clientWidth / level / 3
-        : 40
-    );
-  }, [level]);
+  useEffect(() => {}, [level]);
 
   return (

[Survived] ConditionalExpression
components/Main/Cards/CardsContainer.tsx:33:7
 
   useEffect(() => {
     setSize(
-      elementRef.current?.clientWidth && level
+      false
         ? elementRef.current?.clientWidth / level / 3
         : 40

[Survived] ConditionalExpression
components/Main/Cards/CardsContainer.tsx:33:7
 
   useEffect(() => {
     setSize(
-      elementRef.current?.clientWidth && level
+      true
         ? elementRef.current?.clientWidth / level / 3
         : 40

[NoCoverage] ArithmeticOperator
components/Main/Cards/CardsContainer.tsx:34:11
   useEffect(() => {
     setSize(
       elementRef.current?.clientWidth && level
-        ? elementRef.current?.clientWidth / level / 3
+        ? elementRef.current?.clientWidth * level / 3
         : 40
     );

[NoCoverage] OptionalChaining
components/Main/Cards/CardsContainer.tsx:34:11
   useEffect(() => {
     setSize(
       elementRef.current?.clientWidth && level
-        ? elementRef.current?.clientWidth / level / 3
+        ? elementRef.current.clientWidth / level / 3
         : 40
     );

[Survived] ArrayDeclaration
components/Main/Cards/CardsContainer.tsx:37:6
         ? elementRef.current?.clientWidth / level / 3
         : 40
     );
-  }, [level]);
+  }, []);
 
   return (
