[Killed] BlockStatement
src/components/Auth/Auth.tsx:13:77
   onSubmit: () => void;
 }
 
-export const Auth: React.FC<AuthProps> = ({ onChange, value, onSubmit }) => {
-  return (
-    <div className={s.wrap}>
-      <h1 className={s.title} data-testid="auth-title">
-        Как вас зовут?
-      </h1>
-      <form onSubmit={onSubmit} className={s.form}>
-        <input
-          data-testid="auth-input"
-          required
-          className={clsx(ui.input, s.input)}
-          type="text"
-          placeholder="Ваше имя"
-          onChange={onChange}
-          value={value}
-        />
-        <Button className={s.btn} data-testid="auth-btn" type="submit">
-          Войти
-        </Button>
-      </form>
-    </div>
-  );
-};
+export const Auth: React.FC<AuthProps> = ({ onChange, value, onSubmit }) => {};
 
 export default memo(Auth);
killedBy: AuthContainer Auth entry logic
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="auth-input"]

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>
