[Survived] BlockStatement
components/Main/Form/FormContainer.tsx:24:19
   const level = useInput<HTMLSelectElement>(settings.level);
   const complexity = useInput<HTMLSelectElement>(settings.complexity);
 
-  useEffect(() => {
-    level.onChange({ target: { value: settings.level } });
-  }, [settings]);
+  useEffect(() => {}, [settings]);
 
   const onSubmit = useCallback(

[Survived] ObjectLiteral
components/Main/Form/FormContainer.tsx:25:30
   const complexity = useInput<HTMLSelectElement>(settings.complexity);
 
   useEffect(() => {
-    level.onChange({ target: { value: settings.level } });
+    level.onChange({ target: {} });
   }, [settings]);
 

[Survived] ArrayDeclaration
components/Main/Form/FormContainer.tsx:26:6
 
   useEffect(() => {
     level.onChange({ target: { value: settings.level } });
-  }, [settings]);
+  }, []);
 
   const onSubmit = useCallback(

[NoCoverage] BlockStatement
components/Main/Form/FormContainer.tsx:29:48
   }, [settings]);
 
   const onSubmit = useCallback(
-    async (e: ChangeEvent<HTMLFormElement>) => {
-      e.preventDefault();
-      dispatch(
-        setSettings({
-          level: level.value,
-          complexity: complexity.value,
-        })
-      );
-    },
+    async (e: ChangeEvent<HTMLFormElement>) => {},
     [complexity.value, dispatch, level.value]
   );

[Killed] BlockStatement
components/Main/Form/FormContainer.tsx:41:30
     [complexity.value, dispatch, level.value]
   );
 
-  const form = useMemo(() => {
-    return {
-      level,
-      complexity,
-    };
-  }, [complexity, level]);
+  const form = useMemo(() => {}, [complexity, level]);
 
   return <Form onSubmit={onSubmit} form={form} disabled={status === "start"} />;
killedBy: FormContainer entry levelSelect
statusReason: TypeError: Cannot read properties of undefined (reading 'level')

[Killed] ObjectLiteral
components/Main/Form/FormContainer.tsx:42:12
   );
 
   const form = useMemo(() => {
-    return {
-      level,
-      complexity,
-    };
+    return {};
   }, [complexity, level]);
 
killedBy: FormContainer entry levelSelect
statusReason: TypeError: Cannot read properties of undefined (reading 'onChange')

[Killed] ConditionalExpression
components/Main/Form/FormContainer.tsx:48:58
     };
   }, [complexity, level]);
 
-  return <Form onSubmit={onSubmit} form={form} disabled={status === "start"} />;
+  return <Form onSubmit={onSubmit} form={form} disabled={false} />;
 };
 
killedBy: FormContainer check disabled play button if status 'start'
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="button button" data-testid="play-btn" type="submit" />

[Killed] ConditionalExpression
components/Main/Form/FormContainer.tsx:48:58
     };
   }, [complexity, level]);
 
-  return <Form onSubmit={onSubmit} form={form} disabled={status === "start"} />;
+  return <Form onSubmit={onSubmit} form={form} disabled={true} />;
 };
 
killedBy: FormContainer check enabled play button if status 'end'
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button class="button button" data-testid="play-btn" disabled="" type="submit" />
