[Killed] BlockStatement
store/reducers/auth/authSlice.ts:19:54
   name: "auth",
   initialState: authInitialState,
   reducers: {
-    login(state, { payload }: PayloadAction<string>) {
-      state.user.name = payload;
-    },
+    login(state, { payload }: PayloadAction<string>) {},
     logout(state) {
       state.user.name = "";
killedBy: AuthProvider login, then user name is correct
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Vasya"
Received: ""

[Killed] BlockStatement
store/reducers/auth/authSlice.ts:22:19
     login(state, { payload }: PayloadAction<string>) {
       state.user.name = payload;
     },
-    logout(state) {
-      state.user.name = "";
-    },
+    logout(state) {},
   },
 });
killedBy: authReducer should add user if action logout
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "user": Object {
-     "name": "",
