[Killed] BlockStatement
store/saga/auth/authSaga.ts:6:31
 import { LOGOUT_SAGA } from "../actions/types";
 import { resetState } from "../../reducers/game/gameSlice";
 
-export function* logoutSaga() {
-  yield takeEvery(LOGOUT_SAGA, function* () {
-    yield put({ type: logout.type });
-    yield put({ type: resetState.type });
-  });
-}
+export function* logoutSaga() {}
 
killedBy: authSaga LOGOUT_SAGA
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
store/saga/auth/authSaga.ts:7:45
 import { resetState } from "../../reducers/game/gameSlice";
 
 export function* logoutSaga() {
-  yield takeEvery(LOGOUT_SAGA, function* () {
-    yield put({ type: logout.type });
-    yield put({ type: resetState.type });
-  });
+  yield takeEvery(LOGOUT_SAGA, function* () {});
 }
 
killedBy: authSaga LOGOUT_SAGA
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
