[NoCoverage] BlockStatement
src/components/Main/MainContainer.tsx:8:48
 import { settingsSelector } from "../../store/reducers/game/selectors";
 
 export const GameContext = createContext<GameHookType>({} as GameHookType);
-export const MainContainer: React.FC = ({}) => {
-  const dispatch = useAppDispatch();
-  const settings = useAppSelector(settingsSelector);
-  const mounted = useRef(0);
-
-  const { gameStart } = useGame({
-    dispatch,
-    settings,
-  });
-
-  useEffect(() => {
-    if (mounted.current > 1) {
-      gameStart();
-    }
-    mounted.current++;
-  }, [gameStart]);
-
-  return <Main />;
-};
+export const MainContainer: React.FC = ({}) => {};
 
 export default MainContainer;

[NoCoverage] ObjectLiteral
src/components/Main/MainContainer.tsx:13:33
   const settings = useAppSelector(settingsSelector);
   const mounted = useRef(0);
 
-  const { gameStart } = useGame({
-    dispatch,
-    settings,
-  });
+  const { gameStart } = useGame({});
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/Main/MainContainer.tsx:18:19
     settings,
   });
 
-  useEffect(() => {
-    if (mounted.current > 1) {
-      gameStart();
-    }
-    mounted.current++;
-  }, [gameStart]);
+  useEffect(() => {}, [gameStart]);
 
   return <Main />;

[NoCoverage] EqualityOperator
src/components/Main/MainContainer.tsx:19:9
   });
 
   useEffect(() => {
-    if (mounted.current > 1) {
+    if (mounted.current <= 1) {
       gameStart();
     }

[NoCoverage] ConditionalExpression
src/components/Main/MainContainer.tsx:19:9
   });
 
   useEffect(() => {
-    if (mounted.current > 1) {
+    if (true) {
       gameStart();
     }

[NoCoverage] UpdateOperator
src/components/Main/MainContainer.tsx:22:5
     if (mounted.current > 1) {
       gameStart();
     }
-    mounted.current++;
+    mounted.current--;
   }, [gameStart]);
 
