[Killed] ArrowFunction
store/reducers/auth/selector.ts:3:33
 import { RootState } from "../../store";
 
-export const userNameSelector = (state: RootState) => state.auth.user.name;
+export const userNameSelector = () => undefined;
 
killedBy: AuthProvider userName correctly loads
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Vasya"
Received: ""
