[NoCoverage] BlockStatement
src/components/Navigation/index.tsx:17:45
   </HeaderWrap>
 );
 
-export const Navigation: React.FC = ({}) => {
-  return (
-    <AuthProvider>
-      <Routes>
-        <Route path="/auth" element={<AuthPage />} />
-        <Route index element={mainElement} />
-        <Route path="*" element={<h1>ТАкой страницы нет!</h1>} />
-      </Routes>
-    </AuthProvider>
-  );
-};
+export const Navigation: React.FC = ({}) => {};
 
 export default Navigation;
