[NoCoverage] BlockStatement
src/components/Navigation/ProtectedRoute.tsx:7:7
 
 export const ProtectedRoute: React.FC<PropsWithChildren<any>> = ({
   children,
-}) => {
-  const { user } = useContext(AuthProviderContext);
-
-  const location = useLocation();
-  if (user) {
-    return children;
-  }
-  return <Navigate to="/auth" state={{ from: location }} replace />;
-};
+}) => {};
 
 export default ProtectedRoute;

[NoCoverage] BlockStatement
src/components/Navigation/ProtectedRoute.tsx:11:13
   const { user } = useContext(AuthProviderContext);
 
   const location = useLocation();
-  if (user) {
-    return children;
-  }
+  if (user) {}
   return <Navigate to="/auth" state={{ from: location }} replace />;
 };

[NoCoverage] ConditionalExpression
src/components/Navigation/ProtectedRoute.tsx:11:7
   const { user } = useContext(AuthProviderContext);
 
   const location = useLocation();
-  if (user) {
+  if (false) {
     return children;
   }

[NoCoverage] ObjectLiteral
src/components/Navigation/ProtectedRoute.tsx:14:38
   if (user) {
     return children;
   }
-  return <Navigate to="/auth" state={{ from: location }} replace />;
+  return <Navigate to="/auth" state={{}} replace />;
 };
 
