[NoCoverage] BlockStatement
ReactLearnOtus/src/helpers/helpers.ts:1:54
-export const getLocalStorageState = (key: string) => {
-  try {
-    return JSON.parse(<string>localStorage.getItem(key));
-  } catch (e) {
-    return null;
-  }
-};
+export const getLocalStorageState = (key: string) => {};
 

[NoCoverage] BlockStatement
ReactLearnOtus/src/helpers/helpers.ts:2:7
 export const getLocalStorageState = (key: string) => {
-  try {
-    return JSON.parse(<string>localStorage.getItem(key));
-  } catch (e) {
+  try {} catch (e) {
     return null;
   }

[NoCoverage] BlockStatement
ReactLearnOtus/src/helpers/helpers.ts:4:15
 export const getLocalStorageState = (key: string) => {
   try {
     return JSON.parse(<string>localStorage.getItem(key));
-  } catch (e) {
-    return null;
-  }
+  } catch (e) {}
 };
 
