[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:6:71
 
 type ColorsCount = Record<Colors, number>;
 
-export const play = (size = 0, complexity: ComplexityType = "low") => {
-  // формируем игровую сетку
-  const playArray: Omit<GridItem, "color">[][] = getPlayArray(size);
-  //считаем количество каждого цвета
-  const colorsCount: ColorsCount = {};
-  //определяем массив цветов
-  const colors = getColorForComplexity(COLORS, complexity);
-  //насыщяем исходный массив рандомными цветами
-  const filledArray: GridItem[][] = playArray.map((row) =>
-    row.map((cols) => {
-      const color = fillColor(colors);
-      colorsCount[color] = color in colorsCount ? ++colorsCount[color] : 1;
-      return { ...cols, color };
-    })
-  );
-  //Вычесляем цвет который нужно найти(которого больше всего в заполненном массиве выше)
-  const { color: searchColor } = getSearchColor(colorsCount);
-  //Вычисляем выйгрышную серию id
-  const winSeries = filledArray
-    .reduce((acc, cur) => [...acc, ...cur], [])
-    .filter((i) => i.color === searchColor)
-    .map((i) => i.id);
-
-  return { filledArray, searchColor, winSeries };
-};
+export const play = (size = 0, complexity: ComplexityType = "low") => {};
 /**
  * Генерирует массив игры(сетку)
killedBy: play func func play func should return object with props ["filledArray", "searchColor", "winSeries"]
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:14:51
   //определяем массив цветов
   const colors = getColorForComplexity(COLORS, complexity);
   //насыщяем исходный массив рандомными цветами
-  const filledArray: GridItem[][] = playArray.map((row) =>
-    row.map((cols) => {
-      const color = fillColor(colors);
-      colorsCount[color] = color in colorsCount ? ++colorsCount[color] : 1;
-      return { ...cols, color };
-    })
+  const filledArray: GridItem[][] = playArray.map(() => undefined
   );
   //Вычесляем цвет который нужно найти(которого больше всего в заполненном массиве выше)
killedBy: play func func play func should return object with props ["filledArray", "searchColor", "winSeries"]
statusReason: TypeError: cur is not iterable

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:15:23
   const colors = getColorForComplexity(COLORS, complexity);
   //насыщяем исходный массив рандомными цветами
   const filledArray: GridItem[][] = playArray.map((row) =>
-    row.map((cols) => {
-      const color = fillColor(colors);
-      colorsCount[color] = color in colorsCount ? ++colorsCount[color] : 1;
-      return { ...cols, color };
-    })
+    row.map((cols) => {})
   );
   //Вычесляем цвет который нужно найти(которого больше всего в заполненном массиве выше)
killedBy: play func func play func should return object with props ["filledArray", "searchColor", "winSeries"]
statusReason: TypeError: Cannot read properties of undefined (reading 'color')

[Survived] UpdateOperator
ReactLearnOtus/src/helpers/play.ts:17:51
   const filledArray: GridItem[][] = playArray.map((row) =>
     row.map((cols) => {
       const color = fillColor(colors);
-      colorsCount[color] = color in colorsCount ? ++colorsCount[color] : 1;
+      colorsCount[color] = color in colorsCount ? --colorsCount[color] : 1;
       return { ...cols, color };
     })

[Killed] ObjectLiteral
ReactLearnOtus/src/helpers/play.ts:18:14
     row.map((cols) => {
       const color = fillColor(colors);
       colorsCount[color] = color in colorsCount ? ++colorsCount[color] : 1;
-      return { ...cols, color };
+      return {};
     })
   );
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "payload": Object {
      "game": Object {

[Survived] MethodExpression
ReactLearnOtus/src/helpers/play.ts:24:21
   //Вычесляем цвет который нужно найти(которого больше всего в заполненном массиве выше)
   const { color: searchColor } = getSearchColor(colorsCount);
   //Вычисляем выйгрышную серию id
-  const winSeries = filledArray
-    .reduce((acc, cur) => [...acc, ...cur], [])
-    .filter((i) => i.color === searchColor)
+  const winSeries = filledArray.reduce((acc, cur) => [...acc, ...cur], [])
     .map((i) => i.id);
 

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:25:13
   const { color: searchColor } = getSearchColor(colorsCount);
   //Вычисляем выйгрышную серию id
   const winSeries = filledArray
-    .reduce((acc, cur) => [...acc, ...cur], [])
+    .reduce(() => undefined, [])
     .filter((i) => i.color === searchColor)
     .map((i) => i.id);
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Survived] ArrayDeclaration
ReactLearnOtus/src/helpers/play.ts:25:45
   const { color: searchColor } = getSearchColor(colorsCount);
   //Вычисляем выйгрышную серию id
   const winSeries = filledArray
-    .reduce((acc, cur) => [...acc, ...cur], [])
+    .reduce((acc, cur) => [...acc, ...cur], ["Stryker was here"])
     .filter((i) => i.color === searchColor)
     .map((i) => i.id);

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:26:13
   //Вычисляем выйгрышную серию id
   const winSeries = filledArray
     .reduce((acc, cur) => [...acc, ...cur], [])
-    .filter((i) => i.color === searchColor)
+    .filter(() => undefined)
     .map((i) => i.id);
 
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -26,16 +26,11 @@
              "value": 1,
            },

[Killed] EqualityOperator
ReactLearnOtus/src/helpers/play.ts:26:20
   //Вычисляем выйгрышную серию id
   const winSeries = filledArray
     .reduce((acc, cur) => [...acc, ...cur], [])
-    .filter((i) => i.color === searchColor)
+    .filter((i) => i.color !== searchColor)
     .map((i) => i.id);
 
killedBy: play func func play check return prop "searchColor", "winSeries"
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 0
Received array:  []

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:27:10
   const winSeries = filledArray
     .reduce((acc, cur) => [...acc, ...cur], [])
     .filter((i) => i.color === searchColor)
-    .map((i) => i.id);
+    .map(() => undefined);
 
   return { filledArray, searchColor, winSeries };
killedBy: play func func play check return prop "searchColor", "winSeries"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00;01;10;11"
Received: ";;;"

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:35:43
  * Генерирует массив игры(сетку)
  * @param size
  */
-export const getPlayArray = (size = 3) => {
-  return Array.from({ length: size }).map((_, rowIndex) => [
-    ...Array.from({ length: size }).map((_, colIndex) => ({
-      id: `${rowIndex}${colIndex}`,
-      value: colIndex,
-    })),
-  ]);
-};
+export const getPlayArray = (size = 3) => {};
 /**
  * Рандомный цвет
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:36:43
  * @param size
  */
 export const getPlayArray = (size = 3) => {
-  return Array.from({ length: size }).map((_, rowIndex) => [
-    ...Array.from({ length: size }).map((_, colIndex) => ({
-      id: `${rowIndex}${colIndex}`,
-      value: colIndex,
-    })),
-  ]);
+  return Array.from({ length: size }).map(() => undefined);
 };
 /**
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:37:41
  */
 export const getPlayArray = (size = 3) => {
   return Array.from({ length: size }).map((_, rowIndex) => [
-    ...Array.from({ length: size }).map((_, colIndex) => ({
-      id: `${rowIndex}${colIndex}`,
-      value: colIndex,
-    })),
+    ...Array.from({ length: size }).map(() => undefined),
   ]);
 };
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,38 +3,30 @@
      "game": Object {
        "filledArray": Array [

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:46:51
 /**
  * Рандомный цвет
  */
-export const fillColor = (colorsArr: Colors[]) => {
-  return <Colors>colorsArr[getRandomArbitrary(0, colorsArr.length)];
-};
+export const fillColor = (colorsArr: Colors[]) => {};
 /**
  * Возвращает массив цветов исходя из уровня сложности
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,40 +2,35 @@
    "payload": Object {
      "game": Object {

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:57:6
 export const getColorForComplexity = (
   COLORS: Colors[] = [],
   complexity: ComplexityType
-) => {
-  let colors;
-  switch (complexity) {
-    case "hard":
-      colors = getRandomArrayItems(
-        COLORS,
-        Math.floor(COLORS.length / 4) <= 1 ? 2 : Math.floor(COLORS.length / 4)
-      );
-      break;
-    case "middle":
-      colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length / 2));
-      break;
-    default:
-      colors = COLORS;
-  }
-  return colors;
-};
+) => {};
 /**
  * Возвращает рандомное значение в диапазоне
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
ReactLearnOtus/src/helpers/play.ts:60:5
 ) => {
   let colors;
   switch (complexity) {
-    case "hard":
-      colors = getRandomArrayItems(
-        COLORS,
-        Math.floor(COLORS.length / 4) <= 1 ? 2 : Math.floor(COLORS.length / 4)
-      );
-      break;
+    case "hard":
     case "middle":
       colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length / 2));
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "white",
    "purple",

[Killed] ConditionalExpression
ReactLearnOtus/src/helpers/play.ts:63:9
     case "hard":
       colors = getRandomArrayItems(
         COLORS,
-        Math.floor(COLORS.length / 4) <= 1 ? 2 : Math.floor(COLORS.length / 4)
+        false ? 2 : Math.floor(COLORS.length / 4)
       );
       break;
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "white",
-   "purple",

[Killed] EqualityOperator
ReactLearnOtus/src/helpers/play.ts:63:9
     case "hard":
       colors = getRandomArrayItems(
         COLORS,
-        Math.floor(COLORS.length / 4) <= 1 ? 2 : Math.floor(COLORS.length / 4)
+        Math.floor(COLORS.length / 4) > 1 ? 2 : Math.floor(COLORS.length / 4)
       );
       break;
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    "white",
-   "purple",

[Killed] ConditionalExpression
ReactLearnOtus/src/helpers/play.ts:66:5
         Math.floor(COLORS.length / 4) <= 1 ? 2 : Math.floor(COLORS.length / 4)
       );
       break;
-    case "middle":
-      colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length / 2));
-      break;
+    case "middle":
     default:
       colors = COLORS;
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,34 +2,34 @@
    "payload": Object {
      "game": Object {

[Killed] ArithmeticOperator
ReactLearnOtus/src/helpers/play.ts:67:54
       );
       break;
     case "middle":
-      colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length / 2));
+      colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length * 2));
       break;
     default:
killedBy: play func func getColorForComplexity check return array if MIDDLE level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    "red",
    "green",

[Killed] ConditionalExpression
ReactLearnOtus/src/helpers/play.ts:69:5
     case "middle":
       colors = getRandomArrayItems(COLORS, Math.ceil(COLORS.length / 2));
       break;
-    default:
-      colors = COLORS;
+    default:
   }
   return colors;
killedBy: play func func play func should return object with props ["filledArray", "searchColor", "winSeries"]
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:79:65
  * @param min
  * @param max
  */
-export const getRandomArbitrary = (min: number, max: number) => {
-  return Math.floor(Math.random() * (max - min) + min);
-};
+export const getRandomArbitrary = (min: number, max: number) => {};
 
 export const getSearchColor = (
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,40 +2,35 @@
    "payload": Object {
      "game": Object {

[Killed] ArithmeticOperator
ReactLearnOtus/src/helpers/play.ts:80:38
  * @param max
  */
 export const getRandomArbitrary = (min: number, max: number) => {
-  return Math.floor(Math.random() * (max - min) + min);
+  return Math.floor(Math.random() * (max + min) + min);
 };
 
killedBy: play func func getRandomArbitrary should return 6 if interval [1,10]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 8

[Killed] ArithmeticOperator
ReactLearnOtus/src/helpers/play.ts:80:21
  * @param max
  */
 export const getRandomArbitrary = (min: number, max: number) => {
-  return Math.floor(Math.random() * (max - min) + min);
+  return Math.floor(Math.random() / (max - min) + min);
 };
 
killedBy: play func func play check return prop filledArray scheme
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "red"
Received: "orange"

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:85:40
 
 export const getSearchColor = (
   colorsCount: ColorsCount
-): { color: Colors; count: number } => {
-  const arr = Object.keys(colorsCount) as Colors[];
-  return arr.reduce(
-    (
-      acc: { color: Colors; count: number },
-      cur
-    ): { color: Colors; count: number } => {
-      return acc.count && acc.count > colorsCount[cur]
-        ? acc
-        : { color: cur, count: colorsCount[cur] };
-    },
-    {} as { color: Colors; count: number }
-  );
-};
+): { color: Colors; count: number } => {};
 /**
  * Возвращает массив рандомных элементов
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot destructure property 'color' of 'getSearchColor(...)' as it is undefined.

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:91:44
     (
       acc: { color: Colors; count: number },
       cur
-    ): { color: Colors; count: number } => {
-      return acc.count && acc.count > colorsCount[cur]
-        ? acc
-        : { color: cur, count: colorsCount[cur] };
-    },
+    ): { color: Colors; count: number } => {},
     {} as { color: Colors; count: number }
   );
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: TypeError: Cannot destructure property 'color' of 'getSearchColor(...)' as it is undefined.

[Killed] ConditionalExpression
ReactLearnOtus/src/helpers/play.ts:92:14
       acc: { color: Colors; count: number },
       cur
     ): { color: Colors; count: number } => {
-      return acc.count && acc.count > colorsCount[cur]
+      return true
         ? acc
         : { color: cur, count: colorsCount[cur] };
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -25,17 +25,12 @@
              "id": "11",
              "value": 1,

[Killed] LogicalOperator
ReactLearnOtus/src/helpers/play.ts:92:14
       acc: { color: Colors; count: number },
       cur
     ): { color: Colors; count: number } => {
-      return acc.count && acc.count > colorsCount[cur]
+      return acc.count || acc.count > colorsCount[cur]
         ? acc
         : { color: cur, count: colorsCount[cur] };
killedBy: play func func getSearchColor should return black
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "color": "black",
-   "count": 10,

[Killed] BlockStatement
ReactLearnOtus/src/helpers/play.ts:104:71
  * @param items исходный массив
  * @param amount количество элементов
  */
-export const getRandomArrayItems = (items: any[] = [], amount = 0) => {
-  return [...Array(items.length).keys()]
-    .sort(() => 0.5 - Math.random())
-    .slice(0, amount)
-    .map((index) => items[index]);
-};
+export const getRandomArrayItems = (items: any[] = [], amount = 0) => {};
 
killedBy: play func func getColorForComplexity check return array if MIDDLE level
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["red", "green", "blue"]
Received: undefined

[Killed] MethodExpression
ReactLearnOtus/src/helpers/play.ts:105:10
  * @param amount количество элементов
  */
 export const getRandomArrayItems = (items: any[] = [], amount = 0) => {
-  return [...Array(items.length).keys()]
-    .sort(() => 0.5 - Math.random())
+  return [...Array(items.length).keys()]
     .slice(0, amount)
     .map((index) => items[index]);
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "white",
-   "purple",

[Killed] MethodExpression
ReactLearnOtus/src/helpers/play.ts:105:10
  * @param amount количество элементов
  */
 export const getRandomArrayItems = (items: any[] = [], amount = 0) => {
-  return [...Array(items.length).keys()]
-    .sort(() => 0.5 - Math.random())
-    .slice(0, amount)
+  return [...Array(items.length).keys()].sort(() => 0.5 - Math.random())
     .map((index) => items[index]);
 };
killedBy: play func func getColorForComplexity check return array if MIDDLE level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    "red",
    "green",

[Killed] ArithmeticOperator
ReactLearnOtus/src/helpers/play.ts:106:17
  */
 export const getRandomArrayItems = (items: any[] = [], amount = 0) => {
   return [...Array(items.length).keys()]
-    .sort(() => 0.5 - Math.random())
+    .sort(() => 0.5 + Math.random())
     .slice(0, amount)
     .map((index) => items[index]);
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "white",
-   "purple",

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:106:11
  */
 export const getRandomArrayItems = (items: any[] = [], amount = 0) => {
   return [...Array(items.length).keys()]
-    .sort(() => 0.5 - Math.random())
+    .sort(() => undefined)
     .slice(0, amount)
     .map((index) => items[index]);
killedBy: play func func getColorForComplexity check return array if HARD level
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "white",
-   "purple",

[Killed] ArrowFunction
ReactLearnOtus/src/helpers/play.ts:108:10
   return [...Array(items.length).keys()]
     .sort(() => 0.5 - Math.random())
     .slice(0, amount)
-    .map((index) => items[index]);
+    .map(() => undefined);
 };
 
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,40 +2,35 @@
    "payload": Object {
      "game": Object {
