[Survived] ArrayDeclaration
ReactLearnOtus/src/hooks/useGame.ts:32:12
 
 export const useGame = ({
   status = "reset",
-  active = [],
+  active = ["Stryker was here"],
   winSeries = [],
   settings,

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:39:39
 }: GameHookP) => {
   const [msg, setMsg] = useState("");
 
-  const gameStart = useCallback(() => {
-    if (!settings.level) {
-      return;
-    }
-    const game = play(settings.level, settings.complexity);
-    dispatch({
-      type: GAME_START_SAGA,
-      payload: { game, level: settings.level },
-    });
-  }, [dispatch, settings]);
+  const gameStart = useCallback(() => {}, [dispatch, settings]);
 
   useEffect(() => {
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BooleanLiteral
ReactLearnOtus/src/hooks/useGame.ts:40:9
   const [msg, setMsg] = useState("");
 
   const gameStart = useCallback(() => {
-    if (!settings.level) {
+    if (settings.level) {
       return;
     }
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:40:9
   const [msg, setMsg] = useState("");
 
   const gameStart = useCallback(() => {
-    if (!settings.level) {
+    if (true) {
       return;
     }
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:50:19
     });
   }, [dispatch, settings]);
 
-  useEffect(() => {
-    if (
-      active.length &&
-      winSeries.length &&
-      active.length === winSeries.length
-    ) {
-      if (winSeries.every((v) => active.some((i) => i === v))) {
-        dispatch(updateStatistics("win"));
-        setMsg("Поздравляем! Вы выиграли!");
-      } else {
-        dispatch(updateStatistics("lose"));
-        setMsg("Проиграли :( Попробуйте, снова!");
-      }
-      dispatch(endGame());
-    }
-  }, [active, dispatch, winSeries]);
+  useEffect(() => {}, [active, dispatch, winSeries]);
 
   const onChooseCard = useCallback(
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Поздравляем! Вы выиграли!
Received:

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:52:7
 
   useEffect(() => {
     if (
-      active.length &&
-      winSeries.length &&
-      active.length === winSeries.length
+      true
     ) {
       if (winSeries.every((v) => active.some((i) => i === v))) {
killedBy: useGame should return object scheme
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "gameReplay": Any<Function>,
    "gameStart": Any<Function>,

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:52:7
 
   useEffect(() => {
     if (
-      active.length &&
-      winSeries.length &&
+      true &&
       active.length === winSeries.length
     ) {
killedBy: useGame should return object scheme
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "gameReplay": Any<Function>,
    "gameStart": Any<Function>,

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:54:7
     if (
       active.length &&
       winSeries.length &&
-      active.length === winSeries.length
+      true
     ) {
       if (winSeries.every((v) => active.some((i) => i === v))) {
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Поздравляем! Вы выиграли!
Received:
  Проиграли :( Попробуйте, снова!

[Killed] EqualityOperator
ReactLearnOtus/src/hooks/useGame.ts:54:7
     if (
       active.length &&
       winSeries.length &&
-      active.length === winSeries.length
+      active.length !== winSeries.length
     ) {
       if (winSeries.every((v) => active.some((i) => i === v))) {
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Поздравляем! Вы выиграли!
Received:
  Проиграли :( Попробуйте, снова!

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:55:7
       active.length &&
       winSeries.length &&
       active.length === winSeries.length
-    ) {
-      if (winSeries.every((v) => active.some((i) => i === v))) {
-        dispatch(updateStatistics("win"));
-        setMsg("Поздравляем! Вы выиграли!");
-      } else {
-        dispatch(updateStatistics("lose"));
-        setMsg("Проиграли :( Попробуйте, снова!");
-      }
-      dispatch(endGame());
-    }
+    ) {}
   }, [active, dispatch, winSeries]);
 
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Поздравляем! Вы выиграли!
Received:

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:56:53
       winSeries.length &&
       active.length === winSeries.length
     ) {
-      if (winSeries.every((v) => active.some((i) => i === v))) {
+      if (winSeries.every((v) => active.some((i) => false))) {
         dispatch(updateStatistics("win"));
         setMsg("Поздравляем! Вы выиграли!");
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] MethodExpression
ReactLearnOtus/src/hooks/useGame.ts:56:11
       winSeries.length &&
       active.length === winSeries.length
     ) {
-      if (winSeries.every((v) => active.some((i) => i === v))) {
+      if (winSeries.some(v => active.some(i => i === v))) {
         dispatch(updateStatistics("win"));
         setMsg("Поздравляем! Вы выиграли!");
killedBy: CardsContainer Game scenarios check lose scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Проиграли :( Попробуйте, снова!
Received:
  Поздравляем! Вы выиграли!

[Survived] StringLiteral
ReactLearnOtus/src/hooks/useGame.ts:57:35
       active.length === winSeries.length
     ) {
       if (winSeries.every((v) => active.some((i) => i === v))) {
-        dispatch(updateStatistics("win"));
+        dispatch(updateStatistics(""));
         setMsg("Поздравляем! Вы выиграли!");
       } else {

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:59:14
       if (winSeries.every((v) => active.some((i) => i === v))) {
         dispatch(updateStatistics("win"));
         setMsg("Поздравляем! Вы выиграли!");
-      } else {
-        dispatch(updateStatistics("lose"));
-        setMsg("Проиграли :( Попробуйте, снова!");
-      }
+      } else {}
       dispatch(endGame());
     }
killedBy: CardsContainer Game scenarios check lose scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Проиграли :( Попробуйте, снова!
Received:

[Survived] StringLiteral
ReactLearnOtus/src/hooks/useGame.ts:60:35
         dispatch(updateStatistics("win"));
         setMsg("Поздравляем! Вы выиграли!");
       } else {
-        dispatch(updateStatistics("lose"));
+        dispatch(updateStatistics(""));
         setMsg("Проиграли :( Попробуйте, снова!");
       }

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:68:22
   }, [active, dispatch, winSeries]);
 
   const onChooseCard = useCallback(
-    (key: string) => {
-      if (active.includes(key) || status === "start") {
-        return;
-      }
-      dispatch(addActiveCard(key));
-    },
+    (key: string) => {},
     [active, status]
   );
killedBy: CardsContainer call Card click func with index param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useGame.ts:69:11
 
   const onChooseCard = useCallback(
     (key: string) => {
-      if (active.includes(key) || status === "start") {
+      if (false) {
         return;
       }
killedBy: useGame NOT should call dispatch if call onChooseCard
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"payload": "10", "type": "game/addActiveCard"}

[Killed] EqualityOperator
ReactLearnOtus/src/hooks/useGame.ts:69:35
 
   const onChooseCard = useCallback(
     (key: string) => {
-      if (active.includes(key) || status === "start") {
+      if (active.includes(key) || status !== "start") {
         return;
       }
killedBy: CardsContainer call Card click func with index param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArrayDeclaration
ReactLearnOtus/src/hooks/useGame.ts:74:5
       }
       dispatch(addActiveCard(key));
     },
-    [active, status]
+    []
   );
 

[NoCoverage] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:77:28
     [active, status]
   );
 
-  const gameReplay = () => {
-    gameStart();
-  };
+  const gameReplay = () => {};
 
   const nextLevel = useCallback(() => {

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useGame.ts:81:39
     gameStart();
   };
 
-  const nextLevel = useCallback(() => {
-    dispatch(levelUp());
-  }, [dispatch]);
+  const nextLevel = useCallback(() => {}, [dispatch]);
 
   return {
killedBy: useGame should dispatch with levelUp if call nextLevel
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"payload": undefined, "type": "game/levelUp"}

Number of calls: 0

[Killed] ObjectLiteral
ReactLearnOtus/src/hooks/useGame.ts:85:10
     dispatch(levelUp());
   }, [dispatch]);
 
-  return {
-    gameStart,
-    gameReplay,
-    nextLevel,
-    onChooseCard,
-    msg,
-  };
+  return {};
 };
 
killedBy: CardsContainer call Card click func with index param
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')
