[NoCoverage] BlockStatement
ReactLearnOtus/src/pages/MainPage.tsx:4:43
 import React from "react";
 import { Main } from "../components/Main";
 
-export const MainPage: React.FC = ({}) => {
-  return <Main />;
-};
+export const MainPage: React.FC = ({}) => {};
 
 export default MainPage;
