[Killed] ArrayDeclaration
store/reducers/game/gameSlice.ts:14:11
 };
 
 export const gameInitialState: GameState = {
-  active: [],
+  active: ["Stryker was here"],
   gameInfo: {} as GameInfo,
   openAll: false,
killedBy: CardsContainer Game scenarios check win scenario
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Поздравляем! Вы выиграли!
Received:

[Killed] BooleanLiteral
store/reducers/game/gameSlice.ts:16:12
 export const gameInitialState: GameState = {
   active: [],
   gameInfo: {} as GameInfo,
-  openAll: false,
+  openAll: true,
   status: "reset",
   settings: {
killedBy: CardsContainer Actions on statuses should boolean prop value FALSE if status 'replay'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:36:7
     setSettings(
       state,
       { payload }: PayloadAction<{ [K in keyof Settings]?: Settings[K] }>
-    ) {
-      state.settings = { ...state.settings, ...payload };
-    },
+    ) {},
     setGameInfo(state, { payload }: PayloadAction<GameInfo>) {
       state.gameInfo = payload;
killedBy: gameReducer should set size
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "complexity": "hard",
-   "level": 3,

[NoCoverage] BlockStatement
store/reducers/game/gameSlice.ts:39:62
     ) {
       state.settings = { ...state.settings, ...payload };
     },
-    setGameInfo(state, { payload }: PayloadAction<GameInfo>) {
-      state.gameInfo = payload;
-    },
+    setGameInfo(state, { payload }: PayloadAction<GameInfo>) {},
     levelUp(state) {
       state.settings.level = ++state.settings.level;

[NoCoverage] BlockStatement
store/reducers/game/gameSlice.ts:42:20
     setGameInfo(state, { payload }: PayloadAction<GameInfo>) {
       state.gameInfo = payload;
     },
-    levelUp(state) {
-      state.settings.level = ++state.settings.level;
-    },
+    levelUp(state) {},
     setStatus(state, { payload }: PayloadAction<Status>) {
       state.status = payload;

[NoCoverage] UpdateOperator
store/reducers/game/gameSlice.ts:43:30
       state.gameInfo = payload;
     },
     levelUp(state) {
-      state.settings.level = ++state.settings.level;
+      state.settings.level = --state.settings.level;
     },
     setStatus(state, { payload }: PayloadAction<Status>) {

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:45:58
     levelUp(state) {
       state.settings.level = ++state.settings.level;
     },
-    setStatus(state, { payload }: PayloadAction<Status>) {
-      state.status = payload;
-    },
+    setStatus(state, { payload }: PayloadAction<Status>) {},
     updateStatistics(
       state,
killedBy: gameReducer should set status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "start"
Received: "reset"

[Survived] BlockStatement
store/reducers/game/gameSlice.ts:51:7
     updateStatistics(
       state,
       { payload }: PayloadAction<"lose" | "win" | "try">
-    ) {
-      state.statistics[payload] = ++state.statistics[payload];
-    },
+    ) {},
     clearActive(state, { payload }: PayloadAction<string[]>) {
       state.active = payload;

[Survived] UpdateOperator
store/reducers/game/gameSlice.ts:52:35
       state,
       { payload }: PayloadAction<"lose" | "win" | "try">
     ) {
-      state.statistics[payload] = ++state.statistics[payload];
+      state.statistics[payload] = --state.statistics[payload];
     },
     clearActive(state, { payload }: PayloadAction<string[]>) {

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:54:62
     ) {
       state.statistics[payload] = ++state.statistics[payload];
     },
-    clearActive(state, { payload }: PayloadAction<string[]>) {
-      state.active = payload;
-    },
+    clearActive(state, { payload }: PayloadAction<string[]>) {},
     resetState() {
       return gameInitialState;
killedBy: gameReducer should clear active
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 4

- Array []
+ Array [
+   "01",

[NoCoverage] BlockStatement
store/reducers/game/gameSlice.ts:57:18
     clearActive(state, { payload }: PayloadAction<string[]>) {
       state.active = payload;
     },
-    resetState() {
-      return gameInitialState;
-    },
+    resetState() {},
     addActiveCard(state, { payload }: PayloadAction<string>) {
       state.active.push(payload);

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:60:62
     resetState() {
       return gameInitialState;
     },
-    addActiveCard(state, { payload }: PayloadAction<string>) {
-      state.active.push(payload);
-    },
+    addActiveCard(state, { payload }: PayloadAction<string>) {},
     reset(state) {
       state.gameInfo = {} as GameInfo;
killedBy: CardsContainer call Card click func with index param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
store/reducers/game/gameSlice.ts:63:18
     addActiveCard(state, { payload }: PayloadAction<string>) {
       state.active.push(payload);
     },
-    reset(state) {
-      state.gameInfo = {} as GameInfo;
-      state.openAll = false;
-      state.active = [];
-    },
+    reset(state) {},
     start(state) {
       state.status = "start";

[NoCoverage] BooleanLiteral
store/reducers/game/gameSlice.ts:65:23
     },
     reset(state) {
       state.gameInfo = {} as GameInfo;
-      state.openAll = false;
+      state.openAll = true;
       state.active = [];
     },

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:68:18
       state.openAll = false;
       state.active = [];
     },
-    start(state) {
-      state.status = "start";
-      state.openAll = true;
-      state.active = [];
-    },
+    start(state) {},
     replay(state) {
       state.openAll = false;
killedBy: gameReducer should clear active,openAll cards, set status 'start' and filled gameInfo if start game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
store/reducers/game/gameSlice.ts:70:23
     },
     start(state) {
       state.status = "start";
-      state.openAll = true;
+      state.openAll = false;
       state.active = [];
     },
killedBy: gameReducer should clear active,openAll cards, set status 'start' and filled gameInfo if start game
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:73:19
       state.openAll = true;
       state.active = [];
     },
-    replay(state) {
-      state.openAll = false;
-      state.active = [];
-      state.status = "replay";
-    },
+    replay(state) {},
     endGame(state) {
       state.status = "end";
killedBy: gameReducer should clear active,openAll cards,status 'replay' if replay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "replay"
Received: "reset"

[Killed] BooleanLiteral
store/reducers/game/gameSlice.ts:74:23
       state.active = [];
     },
     replay(state) {
-      state.openAll = false;
+      state.openAll = true;
       state.active = [];
       state.status = "replay";
killedBy: gameReducer should clear active,openAll cards,status 'replay' if replay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
store/reducers/game/gameSlice.ts:75:22
     },
     replay(state) {
       state.openAll = false;
-      state.active = [];
+      state.active = ["Stryker was here"];
       state.status = "replay";
     },
killedBy: gameReducer should clear active,openAll cards,status 'replay' if replay
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:78:20
       state.active = [];
       state.status = "replay";
     },
-    endGame(state) {
-      state.status = "end";
-      state.openAll = true;
-      state.active = [];
-    },
+    endGame(state) {},
     process(state) {
       state.status = "process";
killedBy: gameReducer should clear active,openAll cards,status 'end' if endGame
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
store/reducers/game/gameSlice.ts:80:23
     },
     endGame(state) {
       state.status = "end";
-      state.openAll = true;
+      state.openAll = false;
       state.active = [];
     },
killedBy: gameReducer should clear active,openAll cards,status 'end' if endGame
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
store/reducers/game/gameSlice.ts:81:22
     endGame(state) {
       state.status = "end";
       state.openAll = true;
-      state.active = [];
+      state.active = ["Stryker was here"];
     },
     process(state) {
killedBy: gameReducer should clear active,openAll cards,status 'end' if endGame
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:83:20
       state.openAll = true;
       state.active = [];
     },
-    process(state) {
-      state.status = "process";
-    },
+    process(state) {},
     setOpenAll(state, { payload }: PayloadAction<boolean>) {
       state.openAll = payload;
killedBy: gameReducer should set process
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "process"
Received: "reset"

[Killed] BlockStatement
store/reducers/game/gameSlice.ts:86:60
     process(state) {
       state.status = "process";
     },
-    setOpenAll(state, { payload }: PayloadAction<boolean>) {
-      state.openAll = payload;
-    },
+    setOpenAll(state, { payload }: PayloadAction<boolean>) {},
   },
 });
killedBy: gameReducer should set openAll
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
