[NoCoverage] BlockStatement
store/saga/game/gameSaga.ts:15:40
 import { PayloadAction } from "@reduxjs/toolkit";
 import { GameInfo } from "../../../types";
 
-export function* delaySaga(tm: number) {
-  yield delay(tm);
-}
+export function* delaySaga(tm: number) {}
 
 export function* startPlaySaga() {

[Killed] BlockStatement
store/saga/game/gameSaga.ts:19:34
   yield delay(tm);
 }
 
-export function* startPlaySaga() {
-  yield takeEvery(
-    GAME_START_SAGA,
-    function* ({
-      payload,
-    }: PayloadAction<{
-      game: GameInfo;
-      level: number;
-    }>) {
-      yield put({ type: updateStatistics.type, payload: "try" });
-      yield put({ type: setGameInfo.type, payload: payload.game });
-      yield call(endOldGame);
-      yield put({ type: start.type });
-      yield call(delaySaga, VIEW_TIMEOUT * payload.level);
-      yield put({ type: setOpenAll.type, payload: false });
-      yield put({ type: setStatus.type, payload: "process" });
-    }
-  );
-}
+export function* startPlaySaga() {}
 
 export function* endOldGame() {
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
store/saga/game/gameSaga.ts:27:9
     }: PayloadAction<{
       game: GameInfo;
       level: number;
-    }>) {
-      yield put({ type: updateStatistics.type, payload: "try" });
-      yield put({ type: setGameInfo.type, payload: payload.game });
-      yield call(endOldGame);
-      yield put({ type: start.type });
-      yield call(delaySaga, VIEW_TIMEOUT * payload.level);
-      yield put({ type: setOpenAll.type, payload: false });
-      yield put({ type: setStatus.type, payload: "process" });
-    }
+    }>) {}
   );
 }
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ObjectLiteral
store/saga/game/gameSaga.ts:28:17
       game: GameInfo;
       level: number;
     }>) {
-      yield put({ type: updateStatistics.type, payload: "try" });
+      yield put({});
       yield put({ type: setGameInfo.type, payload: payload.game });
       yield call(endOldGame);
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ObjectLiteral
store/saga/game/gameSaga.ts:29:17
       level: number;
     }>) {
       yield put({ type: updateStatistics.type, payload: "try" });
-      yield put({ type: setGameInfo.type, payload: payload.game });
+      yield put({});
       yield call(endOldGame);
       yield put({ type: start.type });
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ObjectLiteral
store/saga/game/gameSaga.ts:31:17
       yield put({ type: updateStatistics.type, payload: "try" });
       yield put({ type: setGameInfo.type, payload: payload.game });
       yield call(endOldGame);
-      yield put({ type: start.type });
+      yield put({});
       yield call(delaySaga, VIEW_TIMEOUT * payload.level);
       yield put({ type: setOpenAll.type, payload: false });
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ArithmeticOperator
store/saga/game/gameSaga.ts:32:29
       yield put({ type: setGameInfo.type, payload: payload.game });
       yield call(endOldGame);
       yield put({ type: start.type });
-      yield call(delaySaga, VIEW_TIMEOUT * payload.level);
+      yield call(delaySaga, VIEW_TIMEOUT / payload.level);
       yield put({ type: setOpenAll.type, payload: false });
       yield put({ type: setStatus.type, payload: "process" });
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
call expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BooleanLiteral
store/saga/game/gameSaga.ts:33:51
       yield call(endOldGame);
       yield put({ type: start.type });
       yield call(delaySaga, VIEW_TIMEOUT * payload.level);
-      yield put({ type: setOpenAll.type, payload: false });
+      yield put({ type: setOpenAll.type, payload: true });
       yield put({ type: setStatus.type, payload: "process" });
     }
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ObjectLiteral
store/saga/game/gameSaga.ts:34:17
       yield put({ type: start.type });
       yield call(delaySaga, VIEW_TIMEOUT * payload.level);
       yield put({ type: setOpenAll.type, payload: false });
-      yield put({ type: setStatus.type, payload: "process" });
+      yield put({});
     }
   );
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] StringLiteral
store/saga/game/gameSaga.ts:34:50
       yield put({ type: start.type });
       yield call(delaySaga, VIEW_TIMEOUT * payload.level);
       yield put({ type: setOpenAll.type, payload: false });
-      yield put({ type: setStatus.type, payload: "process" });
+      yield put({ type: setStatus.type, payload: "" });
     }
   );
killedBy: gameSagas startPlaySaga
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[NoCoverage] BlockStatement
store/saga/game/gameSaga.ts:39:31
   );
 }
 
-export function* endOldGame() {
-  yield put({ type: replay.type });
-  yield call(delaySaga, 1000);
-}
+export function* endOldGame() {}
 

[NoCoverage] ObjectLiteral
store/saga/game/gameSaga.ts:40:13
 }
 
 export function* endOldGame() {
-  yield put({ type: replay.type });
+  yield put({});
   yield call(delaySaga, 1000);
 }
