[Killed] LogicalOperator
components/HeaderWrap/Header/index.tsx:20:10
         {user}
       </b>
       <h1 data-testid="header-statistic" className={s.stats}>
-        {statistic && (
-          <>
-            <span>
-              Попыток: <b data-testid="try">{statistic.try}</b>
-            </span>
-            <span>
-              Победил: <b data-testid="win">{statistic.win}</b>
-            </span>
-            <span>
-              Проиграл: <b data-testid="lose">{statistic.lose}</b>
-            </span>
-          </>
-        )}
+        {statistic || <>
+            <span>
+              Попыток: <b data-testid="try">{statistic.try}</b>
+            </span>
+            <span>
+              Победил: <b data-testid="win">{statistic.win}</b>
+            </span>
+            <span>
+              Проиграл: <b data-testid="lose">{statistic.lose}</b>
+            </span>
+          </>}
       </h1>
       <Button onClick={logout} data-testid="header-logout">
killedBy: Header markup Header
statusReason: TypeError: Cannot read properties of null (reading 'try')

[Killed] ConditionalExpression
components/HeaderWrap/Header/index.tsx:20:10
         {user}
       </b>
       <h1 data-testid="header-statistic" className={s.stats}>
-        {statistic && (
-          <>
-            <span>
-              Попыток: <b data-testid="try">{statistic.try}</b>
-            </span>
-            <span>
-              Победил: <b data-testid="win">{statistic.win}</b>
-            </span>
-            <span>
-              Проиграл: <b data-testid="lose">{statistic.lose}</b>
-            </span>
-          </>
-        )}
+        {false}
       </h1>
       <Button onClick={logout} data-testid="header-logout">
killedBy: Header should show statisctic
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="try"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <nav
      class="nav"
      data-testid="nav"
