[Survived] BooleanLiteral
components/Main/Card/index.tsx:14:12
 
 export const Card: React.FC<CardProps> = ({
   color,
-  active = false,
+  active = true,
   onClick,
   style = {},

[Killed] BlockStatement
components/Main/Card/index.tsx:17:7
   active = false,
   onClick,
   style = {},
-}) => {
-  return (
-    <div
-      className={clsx(s.card, active ? s.active : "")}
-      onClick={onClick}
-      style={style}
-      data-testid="card"
-    >
-      <div className={s.front} data-testid="card-front" />
-      <div
-        className={s.back}
-        style={{ backgroundColor: color }}
-        data-testid="card-back"
-      />
-    </div>
-  );
-};
+}) => {};
 
 export default memo(Card);
killedBy: Cards markup Cards
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="card"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="cards"
      data-testid="cards"

[Survived] StringLiteral
components/Main/Card/index.tsx:20:51
 }) => {
   return (
     <div
-      className={clsx(s.card, active ? s.active : "")}
+      className={clsx(s.card, active ? s.active : "Stryker was here!")}
       onClick={onClick}
       style={style}

[Killed] ObjectLiteral
components/Main/Card/index.tsx:28:16
       <div className={s.front} data-testid="card-front" />
       <div
         className={s.back}
-        style={{ backgroundColor: color }}
+        style={{}}
         data-testid="card-back"
       />
killedBy: Cards Cards Logic should filled cards colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "green"
Received: ""
