[Killed] ArrowFunction
components/Main/Form/Form.tsx:37:53
             required
           >
             <option value="" />
-            {Array.from({ length: GRID_LIMIT }).map((_, i) => (
-              <option value={i + 2} key={i}>
-                {i + 1}
-              </option>
-            ))}
+            {Array.from({ length: GRID_LIMIT }).map(() => undefined)}
           </select>
         </div>
killedBy: Form should set select values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: ""

[Killed] ArithmeticOperator
components/Main/Form/Form.tsx:38:30
           >
             <option value="" />
             {Array.from({ length: GRID_LIMIT }).map((_, i) => (
-              <option value={i + 2} key={i}>
+              <option value={i - 2} key={i}>
                 {i + 1}
               </option>
killedBy: Form markup Form
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "0"

[Survived] ArithmeticOperator
components/Main/Form/Form.tsx:39:18
             <option value="" />
             {Array.from({ length: GRID_LIMIT }).map((_, i) => (
               <option value={i + 2} key={i}>
-                {i + 1}
+                {i - 1}
               </option>
             ))}
