[Killed] BooleanLiteral
src/components/ui/Button.tsx:17:14
 
 export const Button: React.FC<PropsWithChildren<ButtonProps>> = ({
   type = "button",
-  disabled = false,
+  disabled = true,
   className,
   children,
killedBy: Cards End Game View should call replay method
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/components/ui/Button.tsx:21:7
   className,
   children,
   ...props
-}) => {
-  return (
-    <button
-      disabled={disabled}
-      type={type}
-      className={clsx(s.button, className)}
-      {...props}
-    >
-      {children}
-    </button>
-  );
-};
+}) => {};
 
 export default Button;
killedBy: FormContainer check disabled play button if status 'start'
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="play-btn"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <form
      data-testid="form"
    >
