[Killed] BlockStatement
ReactLearnOtus/src/hooks/useInput.ts:5:6
 
 export const useInput = <T extends HTMLInputElement | HTMLSelectElement>(
   initialValue: any
-) => {
-  const [value, setValue] = useState(initialValue);
-
-  const onChange = useCallback(
-    (e: ChangeEvent<T> | { target: { value: typeof initialValue } }) => {
-      if (typeof initialValue === "string") {
-        setValue(e.target.value);
-        return;
-      }
-      if (typeof initialValue === "number") {
-        const v = parseInt(e.target.value);
-        setValue(v);
-        return;
-      }
-    },
-    [initialValue]
-  );
-
-  return { value, onChange };
-};
+) => {};
 
killedBy: FormContainer entry levelSelect
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useInput.ts:9:73
   const [value, setValue] = useState(initialValue);
 
   const onChange = useCallback(
-    (e: ChangeEvent<T> | { target: { value: typeof initialValue } }) => {
-      if (typeof initialValue === "string") {
-        setValue(e.target.value);
-        return;
-      }
-      if (typeof initialValue === "number") {
-        const v = parseInt(e.target.value);
-        setValue(v);
-        return;
-      }
-    },
+    (e: ChangeEvent<T> | { target: { value: typeof initialValue } }) => {},
     [initialValue]
   );
killedBy: FormContainer entry levelSelect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: ""

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useInput.ts:10:45
 
   const onChange = useCallback(
     (e: ChangeEvent<T> | { target: { value: typeof initialValue } }) => {
-      if (typeof initialValue === "string") {
-        setValue(e.target.value);
-        return;
-      }
+      if (typeof initialValue === "string") {}
       if (typeof initialValue === "number") {
         const v = parseInt(e.target.value);
killedBy: FormContainer entry complexitySelect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hard"
Received: "low"

[Killed] ConditionalExpression
ReactLearnOtus/src/hooks/useInput.ts:10:11
 
   const onChange = useCallback(
     (e: ChangeEvent<T> | { target: { value: typeof initialValue } }) => {
-      if (typeof initialValue === "string") {
+      if (false) {
         setValue(e.target.value);
         return;
killedBy: FormContainer entry complexitySelect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hard"
Received: "low"

[Killed] BlockStatement
ReactLearnOtus/src/hooks/useInput.ts:14:45
         setValue(e.target.value);
         return;
       }
-      if (typeof initialValue === "number") {
-        const v = parseInt(e.target.value);
-        setValue(v);
-        return;
-      }
+      if (typeof initialValue === "number") {}
     },
     [initialValue]
killedBy: FormContainer entry levelSelect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: ""

[Killed] EqualityOperator
ReactLearnOtus/src/hooks/useInput.ts:14:11
         setValue(e.target.value);
         return;
       }
-      if (typeof initialValue === "number") {
+      if (typeof initialValue !== "number") {
         const v = parseInt(e.target.value);
         setValue(v);
killedBy: FormContainer entry levelSelect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: ""

[Killed] ObjectLiteral
ReactLearnOtus/src/hooks/useInput.ts:23:10
     [initialValue]
   );
 
-  return { value, onChange };
+  return {};
 };
 
killedBy: FormContainer entry levelSelect
statusReason: TypeError: level.onChange is not a function
