[Killed] ArrowFunction
src/store/middlewares/locaStorageMiddleware.ts:4:3
 import { Middleware } from "@reduxjs/toolkit";
 
 export const locaStorageMiddleware: Middleware =
-  ({ getState }) =>
-  (next) =>
-  (action) => {
-    localStorage.setItem("state", JSON.stringify(getState()));
-    return next(action);
-  };
+  () => undefined;
 
killedBy: localStorageMiddleWare call localstorage with state JSON.stringify
statusReason: TypeError: (0 , _locaStorageMiddleware.locaStorageMiddleware)(...) is not a function

[Killed] ArrowFunction
src/store/middlewares/locaStorageMiddleware.ts:5:3
 
 export const locaStorageMiddleware: Middleware =
   ({ getState }) =>
-  (next) =>
-  (action) => {
-    localStorage.setItem("state", JSON.stringify(getState()));
-    return next(action);
-  };
+  () => undefined;
 
killedBy: localStorageMiddleWare call localstorage with state JSON.stringify
statusReason: TypeError: (0 , _locaStorageMiddleware.locaStorageMiddleware)(...)(...) is not a function

[Killed] BlockStatement
src/store/middlewares/locaStorageMiddleware.ts:6:15
 export const locaStorageMiddleware: Middleware =
   ({ getState }) =>
   (next) =>
-  (action) => {
-    localStorage.setItem("state", JSON.stringify(getState()));
-    return next(action);
-  };
+  (action) => {};
 
killedBy: localStorageMiddleWare call localstorage with state JSON.stringify
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
