[Killed] StringLiteral
ReactLearnOtus/src/helpers/const.ts:14:3
   "purple",
   "yellow",
   "grey",
-  "pink",
+  "",
 ];
 
killedBy: CardsContainer call Card click func with index param
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."
