[Survived] ArrowFunction
store/reducers/game/selectors.ts:3:33
 import { RootState } from "../../store";
 
-export const areaSizeSelector = (state: RootState) => state.game.settings.level;
+export const areaSizeSelector = () => undefined;
 export const openAllSelector = (state: RootState) => state.game.openAll;
 export const gameStatusSelector = (state: RootState) => state.game.status;

[Survived] ArrowFunction
store/reducers/game/selectors.ts:4:32
 import { RootState } from "../../store";
 
 export const areaSizeSelector = (state: RootState) => state.game.settings.level;
-export const openAllSelector = (state: RootState) => state.game.openAll;
+export const openAllSelector = () => undefined;
 export const gameStatusSelector = (state: RootState) => state.game.status;
 export const activeSelector = (state: RootState) => state.game.active;

[Killed] ArrowFunction
store/reducers/game/selectors.ts:5:35
 
 export const areaSizeSelector = (state: RootState) => state.game.settings.level;
 export const openAllSelector = (state: RootState) => state.game.openAll;
-export const gameStatusSelector = (state: RootState) => state.game.status;
+export const gameStatusSelector = () => undefined;
 export const activeSelector = (state: RootState) => state.game.active;
 export const gameInfoSelector = (state: RootState) => state.game.gameInfo;
killedBy: FormContainer check disabled play button if status 'start'
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="button button" data-testid="play-btn" type="submit" />

[Killed] ArrowFunction
store/reducers/game/selectors.ts:6:31
 export const areaSizeSelector = (state: RootState) => state.game.settings.level;
 export const openAllSelector = (state: RootState) => state.game.openAll;
 export const gameStatusSelector = (state: RootState) => state.game.status;
-export const activeSelector = (state: RootState) => state.game.active;
+export const activeSelector = () => undefined;
 export const gameInfoSelector = (state: RootState) => state.game.gameInfo;
 export const statisticSelector = (state: RootState) => state.game.statistics;
killedBy: CardsContainer call Card click func with index param
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
store/reducers/game/selectors.ts:7:33
 export const openAllSelector = (state: RootState) => state.game.openAll;
 export const gameStatusSelector = (state: RootState) => state.game.status;
 export const activeSelector = (state: RootState) => state.game.active;
-export const gameInfoSelector = (state: RootState) => state.game.gameInfo;
+export const gameInfoSelector = () => undefined;
 export const statisticSelector = (state: RootState) => state.game.statistics;
 export const settingsSelector = (state: RootState) => state.game.settings;
killedBy: CardsContainer call Card click func with index param
statusReason: TypeError: Cannot destructure property 'filledArray' of '(0 , _useAppDispatch.useAppSelector)(...)' as it is undefined.

[Survived] ArrowFunction
store/reducers/game/selectors.ts:8:34
 export const gameStatusSelector = (state: RootState) => state.game.status;
 export const activeSelector = (state: RootState) => state.game.active;
 export const gameInfoSelector = (state: RootState) => state.game.gameInfo;
-export const statisticSelector = (state: RootState) => state.game.statistics;
+export const statisticSelector = () => undefined;
 export const settingsSelector = (state: RootState) => state.game.settings;
 

[Killed] ArrowFunction
store/reducers/game/selectors.ts:9:33
 export const activeSelector = (state: RootState) => state.game.active;
 export const gameInfoSelector = (state: RootState) => state.game.gameInfo;
 export const statisticSelector = (state: RootState) => state.game.statistics;
-export const settingsSelector = (state: RootState) => state.game.settings;
+export const settingsSelector = () => undefined;
 
killedBy: FormContainer entry levelSelect
statusReason: TypeError: Cannot read properties of undefined (reading 'level')
