[Killed] StringLiteral
src/store/reducers/rootReducer.ts:10:15
 const gamePersistConfig = {
   key: "game",
   storage,
-  whitelist: ["settings", "statistics"],
+  whitelist: ["", "statistics"],
 };
 export const rootReducer = combineReducers({
killedBy: AuthContainer Auth entry logic
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Survived] ArrayDeclaration
src/store/reducers/rootReducer.ts:10:14
 const gamePersistConfig = {
   key: "game",
   storage,
-  whitelist: ["settings", "statistics"],
+  whitelist: [],
 };
 export const rootReducer = combineReducers({
