[Survived] BlockStatement
src/store/saga/rootSaga.ts:5:37
 import { startPlaySaga } from "./game/gameSaga";
 import { logoutSaga } from "./auth/authSaga";
 
-export default function* rootSaga() {
-  yield all([startPlaySaga(), logoutSaga()]);
-}
+export default function* rootSaga() {}
 
