[Survived] ConditionalExpression
ReactLearnOtus/src/store/store.ts:22:13
 
 export const store = configureStore({
   reducer: persistedReducer,
-  devTools: process.env.NODE_ENV !== "production",
+  devTools: true,
   middleware: [sagaMiddleware],
 });

[Survived] EqualityOperator
ReactLearnOtus/src/store/store.ts:22:13
 
 export const store = configureStore({
   reducer: persistedReducer,
-  devTools: process.env.NODE_ENV !== "production",
+  devTools: process.env.NODE_ENV === "production",
   middleware: [sagaMiddleware],
 });
